app/Controllers/Festividad.php

SELECT *
FROM `festividades`
---
    public function mostrar()
    {
        // Cargar el modelo de Festividad
        $festividadModel = model('FestividadModel');

        // Obtener todas las festividades de la base de datos
        $data['festividades'] = $festividadModel->findAll();