app/Controllers/Gastronomia.php

    public function mostrar()
    {

        //permite que no se pueda acceder a la función sin antes haber iniciad sesión
        $session = session();
        if($session->get('logged_in')!=true){
            return redirect('usuario/login','refresh');
        }

        // Cargar el modelo de Gastronomia
        $gastronomiaModel = model('GastronomiaModel');

        // Obtener todas las filas de la tabla gastronomia
        $data['gastronomias'] = $gastronomiaModel->findAll();
---
SELECT *
FROM `gastronomia`