app/Controllers/Home.php

SELECT *
FROM `hoteles`
---
    public function mostrarFinal()
    {
        $hotelModel = model('HotelModel');
        $data['hoteles'] = $hotelModel->findAll();