app/Controllers/Hotel.php

SELECT *
FROM `hoteles`
---
    public function mostrar()
    {

         // Cargar el modelo de hotel
        $hotelModel = model('HotelModel');
        $data['hoteles'] = $hotelModel->findAll();