app/Controllers/MostrarGastronomia.php

    public function mostrarGastronomia()
    {
        $GastronomiaModel = model('GastronomiaModel');
        $data['gastronomias'] = $GastronomiaModel->findAll();
---
SELECT *
FROM `gastronomia`

    public function mostrarFestividad()
    {
        $festividadModel = model('FestividadModel');
        $data['festividades'] = $festividadModel->findAll();
---
SELECT *
FROM `festividades`