app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `username` LIKE '%fer%' ESCAPE '!'
AND  `password` LIKE '%1234%' ESCAPE '!'
---
    public function index()
    {
        $data['title']="Login";
        $validation =  \Config\Services::validation();
            if (strtolower($this->request->getMethod()) === 'get'){
                return view('common/head') .
                view('usuario/login') .
                view('common/footer');
            }

            $rules = [
                'username' => 'required',
                'password'=>'required'
            ];

            if (! $this->validate($rules)) {
                return view('common/head') .
                view('usuario/login') .
                view('common/footer');
            }
            else{
                //si pasa las reglas
                $username = $_POST['username'];
                $password = $_POST['password'];
                $userModel = model('UserModel');
                $data['usuario']= $userModel->like('username',$username)
                                ->Like('password',$password)
                                ->findAll();